In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline
from collections import Counter
import warnings
warnings.filterwarnings("ignore")

In [2]:
train_input = pd.read_csv("Credit_Risk_Train_data.csv")
test_input = pd.read_csv("Credit_Risk_Validate_data.csv")

In [3]:
print(train_input.columns)
print(test_input.columns)

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')
Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'outcome'],
      dtype='object')

In [4]:
#change column name 
test_input.rename(columns={"outcome": "Loan_Status"},inplace = True)

In [5]:
data_all = pd.concat([train_input,test_input],axis = 0)
data_all.shape

(981, 13)

In [65]:
print(data_all.tail())
data_all.reset_index(inplace = True,drop =True)

      Loan_ID Gender Married Dependents     Education Self_Employed  \
362  LP002971   Male     Yes         3+  Not Graduate           Yes
363  LP002975   Male     Yes          0      Graduate            No
364  LP002980   Male      No          0      Graduate            No
365  LP002986   Male     Yes          0      Graduate            No
366  LP002989   Male      No          0      Graduate           Yes

     ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
362             4009             1777.0       113.0             360.0
363             4158              709.0       115.0             360.0
364             3250             1993.0       126.0             360.0
365             5000             2393.0       158.0             360.0
366             9200                0.0        98.0             180.0

     Credit_History Property_Area Loan_Status
362             1.0         Urban           Y
363             1.0         Urban           Y
364             NaN     Semiurban           Y
365             1.0         Rural           N
366             1.0         Rural           Y

In [66]:
print(data_all.tail())

      Loan_ID Gender Married Dependents     Education Self_Employed  \
976  LP002971   Male     Yes         3+  Not Graduate           Yes
977  LP002975   Male     Yes          0      Graduate            No
978  LP002980   Male      No          0      Graduate            No
979  LP002986   Male     Yes          0      Graduate            No
980  LP002989   Male      No          0      Graduate           Yes

     ApplicantIncome  CoapplicantIncome  LoanAmount  Loan_Amount_Term  \
976             4009             1777.0       113.0             360.0
977             4158              709.0       115.0             360.0
978             3250             1993.0       126.0             360.0
979             5000             2393.0       158.0             360.0
980             9200                0.0        98.0             180.0

     Credit_History Property_Area Loan_Status
976             1.0         Urban           Y
977             1.0         Urban           Y
978             NaN     Semiurban           Y
979             1.0         Rural           N
980             1.0         Rural           Y

In [67]:
data_all.isnull().sum()

Loan_ID               0
Gender               24
Married               3
Dependents           25
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [68]:
data_all.shape

(981, 13)

In [69]:
#replace null values
Counter(data_all['Gender'])

Counter({'Male': 775, 'Female': 182, nan: 24})

In [70]:
#fill them by male
print(data_all[data_all['Gender'].isnull()].index.tolist())
gender_null = (data_all[data_all['Gender'].isnull()].index.tolist())

[23, 126, 171, 188, 314, 334, 460, 467, 477, 507, 576, 588, 592, 636, 665, 720, 752, 823, 845, 859, 893, 910, 917, 932]

In [100]:
data_all['Gender'].iloc[gender_null]='Male'

In [101]:
#check if filed
print(sum(data_all['Gender'].isnull()))
Counter(data_all['Gender'])

0

Counter({'Male': 799, 'Female': 182})

In [102]:
print(Counter(data_all['Married']))

Counter({'Yes': 634, 'No': 347})

In [103]:
married_null = (data_all[data_all['Married'].isnull()].index.tolist())
print(data_all[data_all['Married'].isnull()].index.tolist())

[]

In [104]:
data_all['Married'].iloc[married_null]='Yes'

In [105]:
print(sum(data_all['Married'].isnull()))

0

In [106]:
Counter(data_all['Married'])

Counter({'No': 347, 'Yes': 634})

In [107]:
data_all.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents           16
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [108]:
Counter(data_all['Dependents'])

Counter({'0': 554, '1': 160, '2': 160, '3+': 91, nan: 16})

In [109]:
#dependents wrt to marriage
pd.crosstab(data_all['Married'],data_all['Dependents'].isnull())

Dependents  False  True
Married
No            347      0
Yes           618     16

In [110]:
pd.crosstab(data_all['Dependents'],data_all['Married'])

Married      No  Yes
Dependents
0           285  269
1            36  124
2            14  146
3+           12   79

In [111]:
#all bachelors
#dependents missing and married no
bachelor_nulldependent = data_all[(data_all['Married']=="No")&(data_all['Dependents'].isnull())].index.tolist()
print(bachelor_nulldependent)

[]

In [112]:
data_all['Dependents'].iloc[bachelor_nulldependent]='0'

In [113]:
Counter(data_all['Dependents'])

Counter({'0': 554, '1': 160, '2': 160, '3+': 91, nan: 16})

In [114]:
#for 16 missing
#se how many dependentd male &female
pd.crosstab(data_all['Gender'],data_all['Dependents'])

Dependents    0    1    2  3+
Gender
Female      127   32   13   9
Male        427  128  147  82

In [116]:
#so female have less dependants
#check gender of 16 missing
data_all['Gender'].iloc[data_all[data_all['Dependents'].isnull()].index.tolist()]

102      Male
104      Male
120      Male
226      Male
228      Male
301      Male
335      Male
346      Male
435    Female
517      Male
571      Male
660      Male
725      Male
816      Male
861      Male
865      Male
Name: Gender, dtype: object

In [117]:
pd.crosstab((data_all['Gender']=='Male')&(data_all['Married']=='Yes'),data_all['Dependents'])

Dependents    0    1    2  3+
row_0
False       318   48   23  15
True        236  112  137  76

In [118]:
#lets fill the dependent wiith 1
data_all['Dependents'].iloc[data_all[data_all['Dependents'].isnull()].index.tolist()] = '1'
data_all.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents            0
Education             0
Self_Employed        55
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [119]:
Counter(data_all['Self_Employed'])

Counter({'No': 807, 'Yes': 119, nan: 55})

In [120]:
self_emp_null = data_all[data_all['Self_Employed'].isnull()].index.tolist()

In [121]:
#fill missing with no
data_all['Self_Employed'].iloc[self_emp_null]='No'

In [122]:
data_all.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents            0
Education             0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           27
Loan_Amount_Term     20
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [123]:
#to check loanamt and loan amt ter nan
pd.crosstab(data_all['LoanAmount'].isnull(),data_all['Loan_Amount_Term'].isnull())

Loan_Amount_Term  False  True
LoanAmount
False               934     20
True                 27      0

In [124]:
pd.crosstab(data_all['LoanAmount'].isnull(),data_all['Loan_Amount_Term'])

Loan_Amount_Term,6.0,12.0,36.0,60.0,84.0,120.0,180.0,240.0,300.0,350.0,360.0,480.0
LoanAmount,,,,,,,,,,,,
False,1,2,3,3,7,4,64,7,20,1,800,22
True,0,0,0,0,0,0,2,1,0,0,23,1

In [125]:
data_all.groupby(data_all['Loan_Amount_Term'])['LoanAmount'].mean()

Loan_Amount_Term
6.0       95.000000
12.0     185.500000
36.0     117.666667
60.0     139.666667
84.0     121.142857
120.0     36.750000
180.0    131.125000
240.0    128.857143
300.0    166.250000
350.0    133.000000
360.0    144.420000
480.0    137.181818
Name: LoanAmount, dtype: float64

In [126]:
#fill missing values in loan amt
#with respect to mean
data_all['LoanAmount'][(data_all['LoanAmount'].isnull())&(data_all['Loan_Amount_Term']==360)]=144
data_all['LoanAmount'][(data_all['LoanAmount'].isnull())&(data_all['Loan_Amount_Term']==480)]=137

In [127]:
data_all['LoanAmount'][(data_all['LoanAmount'].isnull())]=130

In [128]:
#lets fill loanamt
(data_all['Loan_Amount_Term']).value_counts()

360.0    823
180.0     66
480.0     23
300.0     20
240.0      8
84.0       7
120.0      4
36.0       3
60.0       3
12.0       2
350.0      1
6.0        1
Name: Loan_Amount_Term, dtype: int64

In [129]:
data_all['Loan_Amount_Term'][(data_all['Loan_Amount_Term'].isnull())]=360

In [130]:
data_all.isnull().sum()

Loan_ID               0
Gender                0
Married               0
Dependents            0
Education             0
Self_Employed         0
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term      0
Credit_History       79
Property_Area         0
Loan_Status           0
dtype: int64

In [131]:
print(data_all[data_all['Credit_History'].isnull()].index.tolist())

[16, 24, 30, 42, 79, 83, 86, 95, 117, 125, 129, 130, 156, 181, 187, 198, 219, 236, 237, 259, 260, 279, 309, 313, 317, 318, 323, 348, 363, 377, 392, 395, 411, 444, 449, 451, 460, 473, 490, 491, 497, 503, 506, 530, 533, 544, 556, 565, 583, 600, 617, 626, 640, 642, 659, 704, 713, 718, 729, 753, 757, 778, 791, 793, 799, 816, 834, 873, 876, 879, 896, 900, 919, 943, 950, 965, 972, 974, 978]

In [132]:
Counter(data_all['Credit_History'])

Counter({1.0: 754,
         0.0: 148,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1,
         nan: 1})

In [133]:
pd.crosstab(data_all['Gender'],data_all['Credit_History'])

Credit_History  0.0  1.0
Gender
Female           30  135
Male            118  619

In [134]:
pd.crosstab(data_all['Self_Employed'],data_all['Credit_History'])

Credit_History  0.0  1.0
Self_Employed
No              134  658
Yes              14   96

In [135]:
pd.crosstab(data_all['Education'],data_all['Credit_History'])

Credit_History  0.0  1.0
Education
Graduate        106  596
Not Graduate     42  158

In [136]:
data_all['Credit_History'][data_all['Credit_History'].isnull()]=1

In [137]:
data_all.isnull().sum()

Loan_ID              0
Gender               0
Married              0
Dependents           0
Education            0
Self_Employed        0
ApplicantIncome      0
CoapplicantIncome    0
LoanAmount           0
Loan_Amount_Term     0
Credit_History       0
Property_Area        0
Loan_Status          0
dtype: int64

In [138]:
import pickle

fh = open("data_all.pkl","bw")
pickle.dump(data_all,fh)
fh.close()